---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.FieldDomainPoints
source: html/16cefc98-1da3-b10e-8a16-33204a45430c.htm
---
# FieldDomainPoints Properties

Specifies whether the .NET object represents a valid Revit entity.